---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Events.RevitAPIPreDocEventArgs
source: html/f8ee435b-a478-b233-c784-a9f3dcf05721.htm
---
# RevitAPIPreDocEventArgs Members

When the event is cancellable, may call the Cancel() method to cancel it.